{"title": ["NASA's Mars 2020 Rover Tests Descent-Stage Separation", "NASA's Perseverance Rover Mission Getting in Shape for Launch", "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance", "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth", "With Mars Methane Mystery Unsolved, Curiosity Serves Scientists a New One: Oxygen", "NASA's Mars 2020 Will Hunt for Microscopic Fossils", "5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover", "NASA Updates Mars 2020 Mission Environmental Review", "NASA's Curiosity Keeps Rolling As Team Operates Rover From Home", "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet", "Curiosity Mars Rover's Summer Road Trip Has Begun", "NASA's Curiosity Mars Rover Snaps Its Highest-Resolution Panorama Yet", "NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet", "3 Things We've Learned From NASA's Mars InSight", "Three New Views of Mars' Moon Phobos"], "preview": ["A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft.", "Stacking spacecraft components on top of each other is one of the final assembly steps before a mission launches to the Red Planet.", "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan.", "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars.", "For the first time in the history of space exploration, scientists have measured the seasonal changes in the gases that fill the air directly above the surface of Gale Crater on Mars.", "A new paper identifies a ring of minerals at the rover's landing site that are ideal for fossilizing microbial life.", "The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative.", "NASA and the Department of Energy have completed a more detailed risk analysis for the Mars 2020 rover launch from Florida.", "The team has learned to meet new challenges as they work remotely on the Mars mission.", "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July.", "After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp.", "To go along with the stunning 1.8-billion-pixel image, a new video offers a sweeping view of the Red Planet.", "The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021.", "Scientists are finding new mysteries since the geophysics mission landed two years ago.", "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."]}